In [4]:
coffees = ['아메리카노', '카페라떼', '카페모카', '바닐라라떼', '핸드드립', '콜드브루']
prices = [4100, 4600, 4600, 5100, 6000, 5000]
for i in range(6):
    if prices[i] <=5000:
        print(coffees[i])

아메리카노
카페라떼
카페모카
콜드브루

In [7]:
coffees = ['아메리카노', '카페라떼', '카페모카', '바닐라라떼', '핸드드립', '콜드브루']
prices = [4100, 4600, 4600, 5100, 6000, 5000]

for idx, price in enumerate(prices):
    if price - 500 <= 5000:
        print(coffees[idx])

아메리카노
카페라떼
카페모카
바닐라라떼
콜드브루

>## function

In [8]:
def add(a, b):
    result = a+b
    return result

add(3,6)

9

In [13]:
def sub(a,b):
    return a - b

def mul(a,b):
    return a*b

def div(a,b):
    if b == 0:
        print('Do not divided by zero.')
        return
    return a/b

n1,n2 = 2,0
print(sub(n1,n2))
print(mul(n1,n2))
print(div(n1,n2))

2
0
Do not divided by zero.
None

In [17]:
def set_name(name):
    name = name.upper()
    print(f'Set name as {name}')
    return name

name = set_name('Kim')

Set name as KIM

In [20]:
def save_file():
    save_flag = False
    with open('a.txt') as f:
        f.write(data)
        save_flag = True
    return save_flag

In [21]:
def save_file(file_path):
    with open(file_path) as f:
        f.write(data)

In [23]:
def say_hi():
    print('Hi!')
say_hi()

Hi!

In [26]:
def add_many(*args):
    total = 0
    for arg in args:
        total += arg
    return total

print(add_many(1, 2, 3))
print(add_many(1, 2, 3, 4, 5))
print(add_many(1, 2, 3, 4, 5, 6, 7, 8, 9, 10))

def feed_forward(**kwargs):
    pass

6
15
55

In [29]:
f = lambda a, b : a+b
print(f(3,5))

8

Q. 아래 리스트의 원소들을 원소들의 길이에 따라 정렬하고 싶은 경우엔 어떻게 해야할까?

In [30]:
def get_length(s):
    return len(s)

strings = ['yoon','kim','jessica','jeong']
strings.sort(key=lambda s: len(s))
strings

['kim', 'yoon', 'jeong', 'jessica']

In [32]:
import math
number = 3.14
print(abs(number))
print(math.ceil(number))

3.14
4

In [33]:
import random
random.randint(1,45)

13

In [35]:
# 로또 번호
random.choices(list(range(1,46)), k=6) # 복원추출

[32, 37, 8, 39, 42, 26]

In [36]:
import collections
from collections import defaultdict

D = collections.defaultdict(int)
D = defaultdict(int)
D

defaultdict(int, {})

> ## I_O
list comprehension

In [38]:
a = input()
a, type(a)

10

('10', str)

In [40]:
[x + 2 for x in range(1,4)]

[3, 4, 5]

In [41]:
[int(num) for num in input("숫자 여러개를 입력하세요(단, ','로 구분합니다.)").split(',')]

숫자 여러개를 입력하세요(단, ','로 구분합니다.)1,2,3,4,5,6,7,8,9,10

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

### 2. File I/O

- file I/O란 프로그램에서 파일을 저장하고 불러오는 모든 것들을 의미합니다.

- file에는 txt, png, json, xlsx 등 여러가지 종류가 있습니다.

- 그 중에서 가장 간단하게 사용할 수 있는 데이터는 txt 파일입니다.

> 텍스트 파일을 여는 방법에는 read(), readline(), readlines(), for문을 이용한 방법이 있다. 코드를 통해 각 방법의 차이를 알아보자.

In [4]:
# 파일 현재 위치 알아내기
%pwd

'/Users/goeun/Documents/python/패스트캠퍼스_데이터사이언스(프로그래밍,머신러닝,딥러닝,sql)/파이썬프로그래밍'

In [5]:
# f.read()를 통해 data 폴더안에 있는 test.txt를 read mode로 열어봅니다.
file_path = "/Users/goeun/Documents/python/패스트캠퍼스_데이터사이언스(프로그래밍,머신러닝,딥러닝,sql)/파이썬프로그래밍/data/test.txt"

with open(file_path, 'r') as f:
    data = f.read()

data

'아\n휴\n아이구\n아이쿠\n아이고\n어\n나\n우리\n저희\n따라\n의해\n을\n를\n에\n의\n가\n으로\n로\n에게\n뿐이다\n의거하여\n근거하여\n입각하여\n기준으로\n예하면\n예를 들면\n예를 들자면'

In [6]:
# for문을 통해 data 폴더안에 있는 test.txt를 read mode로 열어서 출력해봅니다.
L = []
with open(file_path, 'r') as f:
    for line in f:
        L.append(line)

L

['아\n',
 '휴\n',
 '아이구\n',
 '아이쿠\n',
 '아이고\n',
 '어\n',
 '나\n',
 '우리\n',
 '저희\n',
 '따라\n',
 '의해\n',
 '을\n',
 '를\n',
 '에\n',
 '의\n',
 '가\n',
 '으로\n',
 '로\n',
 '에게\n',
 '뿐이다\n',
 '의거하여\n',
 '근거하여\n',
 '입각하여\n',
 '기준으로\n',
 '예하면\n',
 '예를 들면\n',
 '예를 들자면']

#### Q. test.txt를 열어서 한글자짜리를 다 지우고 다시 저장하고 싶다. 어떻게 해야할까?

In [8]:
output = []
# test.txt를 read mode로 열고 할 일이 끝나면 자동으로 닫는다.
with open(file_path, 'r') as f:
    data = f.readlines()

print(data)

# 한글자 이상인 텍스트만 output list에 저장한다.
for word in data:
    word = word.strip()
    if len(word) > 1:
        output.append(word)

print(output)
# result.txt로 output list에 있는 내용을 저장하기 위해 write mode로 열었다.

## google에 "디렉토리 구조" 검색!
with open("/Users/goeun/Documents/python/패스트캠퍼스_데이터사이언스(프로그래밍,머신러닝,딥러닝,sql)/파이썬프로그래밍/data/result.txt", 'w') as f:
  # f.write()
    for word in output:
        print(word, file=f)

['아\n', '휴\n', '아이구\n', '아이쿠\n', '아이고\n', '어\n', '나\n', '우리\n', '저희\n', '따라\n', '의해\n', '을\n', '를\n', '에\n', '의\n', '가\n', '으로\n', '로\n', '에게\n', '뿐이다\n', '의거하여\n', '근거하여\n', '입각하여\n', '기준으로\n', '예하면\n', '예를 들면\n', '예를 들자면']
['아이구', '아이쿠', '아이고', '우리', '저희', '따라', '의해', '으로', '에게', '뿐이다', '의거하여', '근거하여', '입각하여', '기준으로', '예하면', '예를 들면', '예를 들자면']

In [36]:
# 제대로 데이터가 저장되어 있는지, 불러와서 확인한다.
L = []
with open("/content/drive/MyDrive/Colab Notebooks/data/result.txt", 'r') as f:
    for line in f:
        L.append(line)

L

['아이구\n',
 '아이쿠\n',
 '아이고\n',
 '우리\n',
 '저희\n',
 '따라\n',
 '의해\n',
 '으로\n',
 '에게\n',
 '뿐이다\n',
 '의거하여\n',
 '근거하여\n',
 '입각하여\n',
 '기준으로\n',
 '예하면\n',
 '예를 들면\n',
 '예를 들자면\n']

### (OPTIONAL) pickle 라이브러리를 통해서 파이썬 object 자체를 저장하기

In [9]:
output

['아이구',
 '아이쿠',
 '아이고',
 '우리',
 '저희',
 '따라',
 '의해',
 '으로',
 '에게',
 '뿐이다',
 '의거하여',
 '근거하여',
 '입각하여',
 '기준으로',
 '예하면',
 '예를 들면',
 '예를 들자면']

In [10]:
# 리스트 자체를 저장할 순 없나? , -> 데이터가 너무 많다면 그냥 txt로 가져오는 게 났다
import pickle

with open("result.pk", 'wb') as f:
    pickle.dump(output, f)

In [11]:
with open("result.pk", 'rb') as f:
    output2 = pickle.load(f)

output2

['아이구',
 '아이쿠',
 '아이고',
 '우리',
 '저희',
 '따라',
 '의해',
 '으로',
 '에게',
 '뿐이다',
 '의거하여',
 '근거하여',
 '입각하여',
 '기준으로',
 '예하면',
 '예를 들면',
 '예를 들자면']

> ## pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series([1,3,5,np.nan,6,8])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
df = pd.DataFrame(data = np.arange(1,49).reshape(12,4), 
                  index=np.arange(12),
                  columns = ['X1','X2','X3','X4'])
df

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [5]:
# dataframe index
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [6]:
# dataframe colums
df.columns

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [11]:
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20],
       [21, 22, 23, 24],
       [25, 26, 27, 28],
       [29, 30, 31, 32],
       [33, 34, 35, 36],
       [37, 38, 39, 40],
       [41, 42, 43, 44],
       [45, 46, 47, 48]])

In [14]:
df[['X2']] 
# df['X2']

    X2
0    2
1    6
2   10
3   14
4   18
5   22
6   26
7   30
8   34
9   38
10  42
11  46

In [16]:
df[['X1']] = df[['X1']] + 2

    X1
0    3
1    7
2   11
3   15
4   19
5   23
6   27
7   31
8   35
9   39
10  43
11  47

In [17]:
df.head()

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [19]:
df.tail()

    X1  X2  X3  X4
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [20]:
df.head(10)

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24
6  25  26  27  28
7  29  30  31  32
8  33  34  35  36
9  37  38  39  40

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     int64
 1   X2      12 non-null     int64
 2   X3      12 non-null     int64
 3   X4      12 non-null     int64
dtypes: int64(4)
memory usage: 480.0 bytes

In [22]:
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [24]:
df.sort_values(by = 'X2', ascending = False)

    X1  X2  X3  X4
11  45  46  47  48
10  41  42  43  44
9   37  38  39  40
8   33  34  35  36
7   29  30  31  32
6   25  26  27  28
5   21  22  23  24
4   17  18  19  20
3   13  14  15  16
2    9  10  11  12
1    5   6   7   8
0    1   2   3   4

In [25]:
df.X1

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: X1, dtype: int64

In [26]:
df[:3]

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [30]:
# df.X1[0]
df.index[0]
df.loc[0]

X1    1
X2    2
X3    3
X4    4
Name: 0, dtype: int64

In [32]:
df.loc[7]

X1    29
X2    30
X3    31
X4    32
Name: 7, dtype: int64

In [33]:
df.loc[4,'X2'] #index=4, columns='X2'

18

In [35]:
df.loc[3:5,'X2':'X4']

   X2  X3  X4
3  14  15  16
4  18  19  20
5  22  23  24

In [44]:
print(df['X3'] > 20)
df[df['X3'] > 20] # row의 개수

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: X3, dtype: bool

    X1  X2  X3  X4
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [48]:
df

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [45]:
df.iloc[0]

X1    1
X2    2
X3    3
X4    4
Name: 0, dtype: int64

In [52]:
df.iloc[[3,4],[0,1]]
df.loc[[3,4],[0,1]] # error = [0,1]대신 컬럼 명 써야함
df.loc[[3,4],['X1','X2']]

   X1  X2
3  13  14
4  17  18

In [56]:
# df.loc[3:10,:]
df.loc[:,'X1':'X2']

    X1  X2
0    1   2
1    5   6
2    9  10
3   13  14
4   17  18
5   21  22
6   25  26
7   29  30
8   33  34
9   37  38
10  41  42
11  45  46

In [58]:
df.iloc[:,0:2]

    X1  X2
0    1   2
1    5   6
2    9  10
3   13  14
4   17  18
5   21  22
6   25  26
7   29  30
8   33  34
9   37  38
10  41  42
11  45  46

In [67]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[0, 1, 2, 3])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[0, 1, 2, 3])

In [68]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [69]:
df2

    A   B   C   D
0  A0  B4  C4  D4
1  A1  B5  C5  D5
2  A2  B6  C6  D6
3  A3  B7  C7  D7

In [70]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [71]:
pd.merge(df1,df2, on="A", how = "outer")

    A B_x C_x D_x B_y C_y D_y
0  A0  B0  C0  D0  B4  C4  D4
1  A1  B1  C1  D1  B5  C5  D5
2  A2  B2  C2  D2  B6  C6  D6
3  A3  B3  C3  D3  B7  C7  D7

In [74]:
pd.merge(df1,df2, on="A",how="left")

    A B_x C_x D_x B_y C_y D_y
0  A0  B0  C0  D0  B4  C4  D4
1  A1  B1  C1  D1  B5  C5  D5
2  A2  B2  C2  D2  B6  C6  D6
3  A3  B3  C3  D3  B7  C7  D7

In [77]:
pd.concat([df1,df2,df3],axis = 1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A0  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A1  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A2  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A3  B7  C7  D7  A11  B11  C11  D11

In [90]:
pd.concat([df1,df2,df3],axis = 0).reset_index(drop=True)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A0   B4   C4   D4
5    A1   B5   C5   D5
6    A2   B6   C6   D6
7    A3   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

> **타이타닉 실습**

In [99]:
titanic = pd.read_csv('data/titanic/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [100]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [101]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [115]:
titanic[titanic.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [116]:
titanic.loc[0:100,'Name'] # loc는 index를 포함

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
96                             Goldschmidt, Mr. George B
97                       Greenfield, Mr. William Bertram
98                  Doling, Mrs. John T (Ada Julia Bone)
99                                     Kantor, Mr. Sinai
100                              Petranec, Miss. Matilda
Name: Name, Length: 101, dtype: object

In [127]:
titanic.loc[110:150,'Name':'Age']
titanic.iloc[0:100,:3]
titanic[titanic.Age > 30]['Fare']
titanic.loc[titanic.Age > 30,"Fare"].mean()

42.35290983606555

In [136]:
pd.pivot_table(data=titanic,index=['Sex'],values=['Survived'],aggfunc = ['sum','mean','count'])

            sum      mean    count
       Survived  Survived Survived
Sex
female      233  0.742038      314
male        109  0.188908      577

In [139]:
pd.pivot_table(data=titanic,index=['Pclass','Sex'],values=['Survived'],aggfunc = ['mean','count'])

                   mean    count
               Survived Survived
Pclass Sex
1      female  0.968085       94
       male    0.368852      122
2      female  0.921053       76
       male    0.157407      108
3      female  0.500000      144
       male    0.135447      347